src/Reports/ОтчетПоВыработкеНаРабочемМесте/ОтчетПоВыработкеНаРабочемМесте.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоВыработкеНаРабочемМесте</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
</mdclass:Report>

src/InformationRegisters/ЭтапыПроизводственныхЗаданий/ЭтапыПроизводственныхЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭтапыПроизводственныхЗаданий</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </resources>
  <resources>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Ремонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ПЗ</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БарКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Reports/ОтчетПоВыработкеНаРабочемМесте/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапка = Макет.ПолучитьОбласть("Шапка");	
ОблРМ = Макет.ПолучитьОбласть("РМ");
ОблИсполнитель = Макет.ПолучитьОбласть("Исполнитель");
ОблИзделие = Макет.ПолучитьОбласть("Изделие");

ОблШапка.Параметры.ДатаНач = Формат(Отчет.Период.ДатаНачала,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ДатаКон = Формат(Отчет.Период.ДатаОкончания,"ДФ=dd.MM.yyyy");
ТабДок.Вывести(ОблШапка);

Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭтапыПроизводственныхЗаданий.РабочееМесто КАК РабочееМесто,
	|	ЭтапыПроизводственныхЗаданий.Исполнитель КАК Исполнитель,
	|	ЭтапыПроизводственныхЗаданий.ДатаОкончания КАК ДатаОкончания,
	|	ЭтапыПроизводственныхЗаданий.Изделие КАК Изделие,
	|	ЭтапыПроизводственныхЗаданий.Количество КАК Количество
	|ИЗ
	|	РегистрСведений.ЭтапыПроизводственныхЗаданий КАК ЭтапыПроизводственныхЗаданий
	|ГДЕ
	|	ЭтапыПроизводственныхЗаданий.ДатаОкончания МЕЖДУ &ДатаНач И &ДатаКон";
	Если Не Исполнитель.Пустая() Тогда
	Запрос.Текст = Запрос.Текст + " И ЭтапыПроизводственныхЗаданий.Исполнитель = &Исполнитель";
	Запрос.УстановитьПараметр("Исполнитель",Исполнитель);	
	КонецЕсли;
		Если СписокРМ.Количество() > 0 Тогда
		Запрос.Текст = Запрос.Текст + " И ЭтапыПроизводственныхЗаданий.РабочееМесто В(&СписокРМ)";
		Запрос.УстановитьПараметр("СписокРМ",СписокРМ);
		КонецЕсли; 
Запрос.Текст = Запрос.Текст + "	УПОРЯДОЧИТЬ ПО
								|	РабочееМесто,
								|	Исполнитель,
								|	Изделие
								|ИТОГИ
								|	СУММА(Количество)
								|ПО
								|	РабочееМесто,
								|	Исполнитель,
								|	Изделие";
Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Отчет.Период.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон",КонецДня(Отчет.Период.ДатаОкончания));
Результат = Запрос.Выполнить();
ВыборкаРМ = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаРМ.Следующий() Цикл
	ОблРМ.Параметры.РМ = ВыборкаРМ.РабочееМесто;
	ОблРМ.Параметры.Кол = ВыборкаРМ.Количество;
	ТабДок.Вывести(ОблРМ);
	ВыборкаИсполнитель = ВыборкаРМ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаИсполнитель.Следующий() Цикл
		ОблИсполнитель.Параметры.Исполнитель = СокрЛП(ВыборкаИсполнитель.Исполнитель.Наименование);
		ОблИсполнитель.Параметры.Кол = ВыборкаИсполнитель.Количество;
		ТабДок.Вывести(ОблИсполнитель);
		ВыборкаИзделие = ВыборкаИсполнитель.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаИзделие.Следующий() Цикл
			ОблИзделие.Параметры.Изделие = ВыборкаИзделие.Изделие;
			ОблИзделие.Параметры.Кол = ВыборкаИзделие.Количество;
			ТабДок.Вывести(ОблИзделие);
			КонецЦикла;	
		КонецЦикла;	
	КонецЦикла;
ТабДок.ФиксацияСверху = 3;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Функция НастройкиНаСервере()
Настройки = Новый Структура("СписокРМ",СписокРМ);
Возврат(Новый Структура("КлючНазначенияИспользования,Настройки","ОтчетПоВыработкеНаРабочемМесте",Настройки));
КонецФункции

&НаКлиенте
Процедура Настройки(Команда)
Результат = ОткрытьФормуМодально("ОбщаяФорма.НастройкиФорм",НастройкиНаСервере());
	Если Результат <> Неопределено Тогда	
	СписокРМ = Результат.СписокРМ;	
	КонецЕсли;
КонецПроцедуры
